var a_idx = 0;
var a = new Array
("馄饨", "烩面", "热干面", "刀削面", "油泼面", "炸酱面","鸡蛋", "炒面", "重庆小面", "米线", "酸辣粉", "土豆粉", "螺狮粉", "凉皮儿", "麻辣烫", "肉夹馍", "羊肉泡馍", "炒饭", "盖浇饭", "烤肉饭", "黄焖鸡米饭", "麻辣香锅", "火锅", "酸菜鱼", "豆浆","烤串", "披萨", "烤鸭", "汉堡", "炸鸡", "寿司", "煎饼果子", "南瓜粥", "牛奶","小龙虾", "牛排", "砂锅", "大排档", "馒头", "西餐", "自助餐", "小笼包", "水果", "西北风", "烧烤", "泡面", "水饺", "日本料理", "涮羊肉", "兰州拉面", "肯德基", "面包", "臊子面", "小笼包", "包子","麦当劳", "沙县小吃", "烤鱼", "海鲜", "铁板烧","韩国料理", "甜点", "鸭血粉丝汤","馄饨","拉面","烩面","热干面","刀削面","油泼面","炸酱面","炒面","重庆小面","米线","酸辣粉","土豆粉","螺狮粉","凉皮儿","麻辣烫","肉夹馍","羊肉汤","炒饭","盖浇饭","卤肉饭","烤肉饭","黄焖鸡米饭","驴肉火烧","川菜","麻辣香锅","火锅","酸菜鱼","烤串","披萨","烤鸭","汉堡","炸鸡","寿司","蟹黄包","煎饼果子","生煎","炒年糕","面包","蛋糕","荷包蛋","烧饼","饽饽","肉夹馍","油条","馄饨","火腿","面条","小笼包","玉米粥","肉包","煎饼果子","饺子","煎蛋","烧卖","生煎","锅贴","包子","酸奶","苹果","梨","香蕉","皮蛋瘦肉粥","蛋挞","南瓜粥","煎饼","玉米糊","泡面","粥","馒头","燕麦片","水煮蛋","米粉","豆浆","牛奶","花卷","豆腐脑","煎饼果子","小米粥","黑米糕","鸡蛋饼","牛奶布丁","水果沙拉","鸡蛋羹","南瓜馅饼","鸡蛋灌饼","奶香小馒头","汉堡包","披萨","八宝粥","三明治","蛋包饭","豆沙红薯饼","驴肉火烧","粥","粢饭糕","蒸饺","白粥","盖浇饭","砂锅","大排档","米线","满汉全席","西餐","麻辣烫","自助餐","炒面","快餐","水果","西北风","馄饨","火锅","烧烤","泡面","水饺","日本料理","涮羊肉","味千拉面","面包","扬州炒饭","自助餐","菜饭骨头汤","茶餐厅","海底捞","西贝莜面村","披萨","麦当劳","KFC","汉堡王","卡乐星","兰州拉面","沙县小吃","烤鱼","烤肉","海鲜","铁板烧","韩国料理","粥","快餐","萨莉亚","桂林米粉","东南亚菜","甜点","农家菜","川菜","粤菜","湘菜","本帮菜","盖饭","浆水面","饼","麻辣烫","水饺","炒面","炒粉","米粉","刀削面","土豆牛肉盖饭","麻婆豆腐","冰箱","书桌","电扇","空调","鼠标","键盘","显示器","电视","台灯","饭盒","手机","餐巾纸","电话","椅子","纸箱","窗帘","插座","被单","报纸","杂志","相框","照片","衣服","土","大哥，饶命啊大哥","吃吃吃！","","就这，还不够我塞牙缝儿","莫慌，抱紧我","吃一个，长一斤","你好看你先吃","听说吃这玩意吃不胖","你先吃，我不饿","不吃不是中国人","配上鸡汤，口味更佳","我仿佛看到了盐水瓶","嗯，好吃么？","饭后注意漱口哦","这菜红烧味道如何？","饭后百步走，活到九十九","据说吃完99%都哭了","惊天内幕！这网页是逗你玩的","我想静静，不要问我静静是谁","解决吃什么难题哪家强？","我就笑笑不说话","转发过100，然并卵","活到老，吃到老","我给你讲个笑话","你别哭喔","你知道怎样得精神分裂症吗？那样我就再不是一个人了。","躲了一辈子的雨，雨会不会很难过","小猪一定不知道自己的肉很好吃吧，真替它们心酸。","心情不好就吃吃吃","念念不忘，必会下单","别低头，哈喇子会掉","今晚我们都是吃货","我这叫圆润，不叫胖","这不叫胖，叫丰满！","吃饭前记得用手机消消毒","集满20个赞，明天早起瘦10斤","好吃的不要不要的","不好吃，不要钱","吃的我蹲下起立就头晕","听说你是广东人？","贝爷，卒。");
a_idx = Math.floor(Math.random() * ((a.length-1) - 0 + 1)) + 0;

jQuery(document).ready(function($) {
    $("body").click(function(e) {
        var a = new Array
("馄饨", "烩面", "热干面", "刀削面", "油泼面", "炸酱面","鸡蛋", "炒面", "重庆小面", "米线", "酸辣粉", "土豆粉", "螺狮粉", "凉皮儿", "麻辣烫", "肉夹馍", "羊肉泡馍", "炒饭", "盖浇饭", "烤肉饭", "黄焖鸡米饭", "麻辣香锅", "火锅", "酸菜鱼", "豆浆","烤串", "披萨", "烤鸭", "汉堡", "炸鸡", "寿司", "煎饼果子", "南瓜粥", "牛奶","小龙虾", "牛排", "砂锅", "大排档", "馒头", "西餐", "自助餐", "小笼包", "水果", "西北风", "烧烤", "泡面", "水饺", "日本料理", "涮羊肉", "兰州拉面", "肯德基", "面包", "臊子面", "小笼包", "包子","麦当劳", "沙县小吃", "烤鱼", "海鲜", "铁板烧","韩国料理", "甜点", "鸭血粉丝汤","馄饨","拉面","烩面","热干面","刀削面","油泼面","炸酱面","炒面","重庆小面","米线","酸辣粉","土豆粉","螺狮粉","凉皮儿","麻辣烫","肉夹馍","羊肉汤","炒饭","盖浇饭","卤肉饭","烤肉饭","黄焖鸡米饭","驴肉火烧","川菜","麻辣香锅","火锅","酸菜鱼","烤串","披萨","烤鸭","汉堡","炸鸡","寿司","蟹黄包","煎饼果子","生煎","炒年糕","面包","蛋糕","荷包蛋","烧饼","饽饽","肉夹馍","油条","馄饨","火腿","面条","小笼包","玉米粥","肉包","煎饼果子","饺子","煎蛋","烧卖","生煎","锅贴","包子","酸奶","苹果","梨","香蕉","皮蛋瘦肉粥","蛋挞","南瓜粥","煎饼","玉米糊","泡面","粥","馒头","燕麦片","水煮蛋","米粉","豆浆","牛奶","花卷","豆腐脑","煎饼果子","小米粥","黑米糕","鸡蛋饼","牛奶布丁","水果沙拉","鸡蛋羹","南瓜馅饼","鸡蛋灌饼","奶香小馒头","汉堡包","披萨","八宝粥","三明治","蛋包饭","豆沙红薯饼","驴肉火烧","粥","粢饭糕","蒸饺","白粥","盖浇饭","砂锅","大排档","米线","满汉全席","西餐","麻辣烫","自助餐","炒面","快餐","水果","西北风","馄饨","火锅","烧烤","泡面","水饺","日本料理","涮羊肉","味千拉面","面包","扬州炒饭","自助餐","菜饭骨头汤","茶餐厅","海底捞","西贝莜面村","披萨","麦当劳","KFC","汉堡王","卡乐星","兰州拉面","沙县小吃","烤鱼","烤肉","海鲜","铁板烧","韩国料理","粥","快餐","萨莉亚","桂林米粉","东南亚菜","甜点","农家菜","川菜","粤菜","湘菜","本帮菜","盖饭","浆水面","饼","麻辣烫","水饺","炒面","炒粉","米粉","刀削面","土豆牛肉盖饭","麻婆豆腐","冰箱","书桌","电扇","空调","鼠标","键盘","显示器","电视","台灯","饭盒","手机","餐巾纸","电话","椅子","纸箱","窗帘","插座","被单","报纸","杂志","相框","照片","衣服","土","大哥，饶命啊大哥","吃吃吃！","","就这，还不够我塞牙缝儿","莫慌，抱紧我","吃一个，长一斤","你好看你先吃","听说吃这玩意吃不胖","你先吃，我不饿","不吃不是中国人","配上鸡汤，口味更佳","我仿佛看到了盐水瓶","嗯，好吃么？","饭后注意漱口哦","这菜红烧味道如何？","饭后百步走，活到九十九","据说吃完99%都哭了","惊天内幕！这网页是逗你玩的","我想静静，不要问我静静是谁","解决吃什么难题哪家强？","我就笑笑不说话","转发过100，然并卵","活到老，吃到老","我给你讲个笑话","你别哭喔","你知道怎样得精神分裂症吗？那样我就再不是一个人了。","躲了一辈子的雨，雨会不会很难过","小猪一定不知道自己的肉很好吃吧，真替它们心酸。","心情不好就吃吃吃","念念不忘，必会下单","别低头，哈喇子会掉","今晚我们都是吃货","我这叫圆润，不叫胖","这不叫胖，叫丰满！","吃饭前记得用手机消消毒","集满20个赞，明天早起瘦10斤","好吃的不要不要的","不好吃，不要钱","吃的我蹲下起立就头晕","听说你是广东人？","贝爷，卒。");
        /*("富强", "民主", "文明", "和谐", "自由", "平等", "公正", "法治", "爱国", "敬业", "诚信", "友善");*/
        var $i = $("<span/>").text(a[a_idx]);
        //a_idx = (a_idx + 1) % a.length;
	a_idx = Math.floor(Math.random() * ((a.length-1) - 0 + 1)) + 0;
        var x = e.pageX,
        y = e.pageY;
        $i.css({
            "z-index": 5,
            "top": y - 20,
            "left": x,
            "position": "absolute",
            "font-weight": "bold",
            "color": "rgb(" + ~~(255 * Math.random()) + "," + ~~(255 * Math.random()) + "," + ~~(255 * Math.random()) + ")"
        });
        $("body").append($i);
        $i.animate({
            "top": y - 180,
            "opacity": 0
        },
			3000,
			function() {
			    $i.remove();
			});
    });
    setTimeout('delay()', 2000);
});

function delay() {
    $(".buryit").removeAttr("onclick");
}
