var a_idx = 0;
var a = new Array
("馄饨", "烩面", "热干面", "刀削面", "油泼面", "炸酱面","鸡蛋", "炒面", "重庆小面", "米线", "酸辣粉", "土豆粉", "螺狮粉", "凉皮儿", "麻辣烫", "肉夹馍", "羊肉泡馍", "炒饭", "盖浇饭", "烤肉饭", "黄焖鸡米饭", "麻辣香锅", "火锅", "酸菜鱼", "豆浆","烤串", "披萨", "烤鸭", "汉堡", "炸鸡", "寿司", "煎饼果子", "南瓜粥", "牛奶","小龙虾", "牛排", "砂锅", "大排档", "馒头", "西餐", "自助餐", "小笼包", "水果", "西北风", "烧烤", "泡面", "水饺", "日本料理", "涮羊肉", "兰州拉面", "肯德基", "面包", "臊子面", "小笼包", "包子","麦当劳", "沙县小吃", "烤鱼", "海鲜", "铁板烧","韩国料理", "甜点", "鸭血粉丝汤","馄饨","拉面","烩面","热干面","刀削面","油泼面","炸酱面","炒面","重庆小面","米线","酸辣粉","土豆粉","螺狮粉","凉皮儿","麻辣烫","肉夹馍","羊肉汤","炒饭","盖浇饭","卤肉饭","烤肉饭","黄焖鸡米饭","驴肉火烧","川菜","麻辣香锅","火锅","酸菜鱼","烤串","披萨","烤鸭","汉堡","炸鸡","寿司","蟹黄包","煎饼果子","生煎","炒年糕","面包","蛋糕","荷包蛋","烧饼","饽饽","肉夹馍","油条","馄饨","火腿","面条","小笼包","玉米粥","肉包","煎饼果子","饺子","煎蛋","烧卖","生煎","锅贴","包子","酸奶","苹果","梨","香蕉","皮蛋瘦肉粥","蛋挞","南瓜粥","煎饼","玉米糊","泡面","粥","馒头","燕麦片","水煮蛋","米粉","豆浆","牛奶","花卷","豆腐脑","煎饼果子","小米粥","黑米糕","鸡蛋饼","牛奶布丁","水果沙拉","鸡蛋羹","南瓜馅饼","鸡蛋灌饼","奶香小馒头","汉堡包","披萨","八宝粥","三明治","蛋包饭","豆沙红薯饼","驴肉火烧","粥","粢饭糕","蒸饺","白粥","盖浇饭","砂锅","大排档","米线","满汉全席","西餐","麻辣烫","自助餐","炒面","快餐","水果","西北风","馄饨","火锅","烧烤","泡面","水饺","日本料理","涮羊肉","味千拉面","面包","扬州炒饭","自助餐","菜饭骨头汤","茶餐厅","海底捞","西贝莜面村","披萨","麦当劳","KFC","汉堡王","卡乐星","兰州拉面","沙县小吃","烤鱼","烤肉","海鲜","铁板烧","韩国料理","粥","快餐","萨莉亚","桂林米粉","东南亚菜","甜点","农家菜","川菜","粤菜","湘菜","本帮菜","盖饭","浆水面","饼","麻辣烫","水饺","炒面","炒粉","米粉","刀削面","土豆牛肉盖饭","麻婆豆腐");
a_idx = Math.floor(Math.random() * ((a.length-1) - 0 + 1)) + 0;

jQuery(document).ready(function($) {
    $("body").click(function(e) {
        var a = new Array
("馄饨", "烩面", "热干面", "刀削面", "油泼面", "炸酱面","鸡蛋", "炒面", "重庆小面", "米线", "酸辣粉", "土豆粉", "螺狮粉", "凉皮儿", "麻辣烫", "肉夹馍", "羊肉泡馍", "炒饭", "盖浇饭", "烤肉饭", "黄焖鸡米饭", "麻辣香锅", "火锅", "酸菜鱼", "豆浆","烤串", "披萨", "烤鸭", "汉堡", "炸鸡", "寿司", "煎饼果子", "南瓜粥", "牛奶","小龙虾", "牛排", "砂锅", "大排档", "馒头", "西餐", "自助餐", "小笼包", "水果", "西北风", "烧烤", "泡面", "水饺", "日本料理", "涮羊肉", "兰州拉面", "肯德基", "面包", "臊子面", "小笼包", "包子","麦当劳", "沙县小吃", "烤鱼", "海鲜", "铁板烧","韩国料理", "甜点", "鸭血粉丝汤","馄饨","拉面","烩面","热干面","刀削面","油泼面","炸酱面","炒面","重庆小面","米线","酸辣粉","土豆粉","螺狮粉","凉皮儿","麻辣烫","肉夹馍","羊肉汤","炒饭","盖浇饭","卤肉饭","烤肉饭","黄焖鸡米饭","驴肉火烧","川菜","麻辣香锅","火锅","酸菜鱼","烤串","披萨","烤鸭","汉堡","炸鸡","寿司","蟹黄包","煎饼果子","生煎","炒年糕","面包","蛋糕","荷包蛋","烧饼","饽饽","肉夹馍","油条","馄饨","火腿","面条","小笼包","玉米粥","肉包","煎饼果子","饺子","煎蛋","烧卖","生煎","锅贴","包子","酸奶","苹果","梨","香蕉","皮蛋瘦肉粥","蛋挞","南瓜粥","煎饼","玉米糊","泡面","粥","馒头","燕麦片","水煮蛋","米粉","豆浆","牛奶","花卷","豆腐脑","煎饼果子","小米粥","黑米糕","鸡蛋饼","牛奶布丁","水果沙拉","鸡蛋羹","南瓜馅饼","鸡蛋灌饼","奶香小馒头","汉堡包","披萨","八宝粥","三明治","蛋包饭","豆沙红薯饼","驴肉火烧","粥","粢饭糕","蒸饺","白粥","盖浇饭","砂锅","大排档","米线","满汉全席","西餐","麻辣烫","自助餐","炒面","快餐","水果","西北风","馄饨","火锅","烧烤","泡面","水饺","日本料理","涮羊肉","味千拉面","面包","扬州炒饭","自助餐","菜饭骨头汤","茶餐厅","海底捞","西贝莜面村","披萨","麦当劳","KFC","汉堡王","卡乐星","兰州拉面","沙县小吃","烤鱼","烤肉","海鲜","铁板烧","韩国料理","粥","快餐","萨莉亚","桂林米粉","东南亚菜","甜点","农家菜","川菜","粤菜","湘菜","本帮菜","盖饭","浆水面","饼","麻辣烫","水饺","炒面","炒粉","米粉","刀削面","土豆牛肉盖饭","麻婆豆腐");
        /*("富强", "民主", "文明", "和谐", "自由", "平等", "公正", "法治", "爱国", "敬业", "诚信", "友善");*/
        var $i = $("<span/>").text(a[a_idx]);
        //a_idx = (a_idx + 1) % a.length;
	a_idx = Math.floor(Math.random() * ((a.length-1) - 0 + 1)) + 0;
        var x = e.pageX,
        y = e.pageY;
        $i.css({
            "z-index": 5,
            "top": y - 20,
            "left": x,
            "position": "absolute",
            "font-weight": "bold",
            "color": "rgb(" + ~~(255 * Math.random()) + "," + ~~(255 * Math.random()) + "," + ~~(255 * Math.random()) + ")"
        });
        $("body").append($i);
        $i.animate({
            "top": y - 180,
            "opacity": 0
        },
			3000,
			function() {
			    $i.remove();
			});
    });
    setTimeout('delay()', 2000);
});

function delay() {
    $(".buryit").removeAttr("onclick");
}
